Autodesk.Revit.DB.PointCloudType.Create(Autodesk.Revit.DB.Document,System.String,System.String)
Creates a new point cloud type for a given point cloud engine.
Remarks:
A list of supported engine identifiers and whether they are file-based or not can be
obtained from PointCloudEngineRegistry. The method GetSupportedEngines() returns a list
of the identifiers registered for engines.
document:
The document in which to create the point cloud.
engineIdentifier:
The string identifying the engine to be invoked.
It should be the file extension or engine identifier registered by the third party.
typeIdentifier:
The file name or the identification string for a non-file based engine.
Returns:
The newly created PointCloudType object to be used to create instances of
this point cloud.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The engine identifier was not found in the Revit session.
-or-
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
The external file could not be found or loaded.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Unable to create a point cloud from the third party engine.
-or-
Linking PCG files is no longer supported.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2012